---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointOrientationType.ToGlobalXYZ
enum: Autodesk.Revit.DB.AdaptivePointOrientationType
source: html/95bf6f69-8714-5342-8a43-ad4f6c8b05a7.htm
---
# Autodesk.Revit.DB.AdaptivePointOrientationType.ToGlobalXYZ

The adaptive point will be oriented to the coordinate system of the document the instance is placed in. This option was previously named: PlacementOrthogonal